from aiogram.types import CallbackQuery
from bot.keyboards.main_menu import back_to_main_menu_keyboard
from aiogram.exceptions import TelegramBadRequest

text = """
Цей бот допомагає:

Дізнатися розклад відключень світла за твоєю адресою (з оновленнями 🟡/синіми зонами)

Отримати графік у зручному вигляді (таблиця + зображення)

Підписатися на автоматичні сповіщення про зміни

🧠 Що робить бот:

Кожні ~15 хв перевіряє нові дані

Якщо графік змінено — сповіщає тебе

Мінімізує фальшиві сповіщення (аналізує хеші даних)

🛠 Як це працює:

Бот не використовує жодних державних API

Дані беруться напряму з сайту “ВОЄ”

Cloudflare-челенджі проходяться автоматично (через FlareSolverr)

🙋 Якщо хочеш допомогти або маєш ідею — просто напиши адміну.
"""


async def show_info(source: CallbackQuery): 
    try:
        await source.message.edit_text(
            text=text, reply_markup=back_to_main_menu_keyboard()
        )
        return
    except TelegramBadRequest:
        await source.message.reply(text=text, reply_markup=back_to_main_menu_keyboard())

