from aiogram.types import CallbackQuery
from bot.keyboards.main_menu import back_to_main_menu_keyboard
from bot.utils import tg_sem_show_service_menu

text = """
Цей бот допомагає:

1. Отримати графік відключень за будь-якою адресою, яка доступна на сайті VOE
2. Побудувати список адрес для отримання графіків
3. По будь-якій збереженій адресі отримувати автоматичні сповіщення про зміни графіку

🧠 Що робить бот для автооновлення графіків:

1. Кожні ~15 хв бігає на сайт voe.com.ua/disconnection/detailed
2. Забирає свіжі графіки для збережених адрес
3. Якщо графіки мають зміни — сповіщає підписанних користувачів

🛠 Як це працює:

- Бот напряму бере графіки з сайту VOE (без API, бо його немає👍👍👍)
- Парсить HTML, перетворюэ графіки у нормальний вигляд
- Відмальовує графіки у вигляді зручних таблиць
- Надсилає юзерам

P.s. Cloudflare-челенджі проходяться автоматично (через FlareSolverr)
P.s.s. Якщо бот не може дістати графіки через проблеми на боці VOE (скоріш за все).
P.s.s.s. Зробіть публічне API для VOE, будь ласка :)
"""


async def show_info(source: CallbackQuery):
    return await tg_sem_show_service_menu(
        bot=source.bot,
        chat_id=source.message.chat.id,
        text=text,
        old_msg_id=source.message.message_id,
        reply_markup=back_to_main_menu_keyboard(),
    )
